# Подобно списку, словарь - это изменяемая коллекция значений. Однако в словарях, в отличие от списков, индексами могут
# быть не только целые числа, но и другие типы данных. Индексы в словарях называются ключами, а ключ вместе с
# соответствующим ему значением - парой "ключ - значение".
# В Python словари обозначаются фигурными скобками ({})
my_cat = {'размер': 'толстый', 'цвет': 'серый', 'характер': 'шумный'}

# Доступ к значениям осуществляется с помощью ключей
print(my_cat['размер'])
print('У моего кота ' + my_cat['цвет'] + ' мех.')

# Индексами в словарях, как и в списках, могут служить целые числа, однако их отсчет необязательно должен начинаться
# с нуля.
spam = {12345: 'Код замка', 42: 'Ответ'}








































































